Public Attributes | List of all members
API_IFCRelationshipData Struct Reference
IFC Data Access
Contains IFC Entity relations which are specific for the IFC. The IFC Entities are represented by their GlobalId. More...
#include <APIdefs_IFC.h>
 Public Attributes
GS::HashTable< API_Guid, API_Guid >  | containmentTable
IFC containment tree in "child->parent" format.
GS::HashTable< API_Guid, API_Guid >  | relFillsTable
Relationships between openings (Doors/Windows/Skylights) and IfcOpeningElements (voids).
GS::HashTable< API_Guid, API_Guid >  | relVoidsTable
Relationships between IfcOpeningElements (voids) and their parent IfcWall or IfcSlab.
GS::HashSet< GS::Pair< API_Guid, API_Guid > >  | assignmentTable
IFC Assigment links, IfcGroup, IfcZone, IfcSystem, IfcRelAssignsToGroup and IfcRelServicesBuildings.
GS::HashTable< API_Guid, API_Guid >  | typeProductTable
IFC Type Products tree.
Detailed Description
Contains IFC Entity relations which are specific for the IFC. The IFC Entities are represented by their GlobalId.
Remarks
This structure is used in API_IFCDifferenceGeneratorState, ACAPI_Markup_ImportFromBCF and ACAPI_ProjectOperation_Save. The IFC containment tree (containmentTable) is in "child ->parent" format. Example: IfcBuilding ->IfcProject IfcSite ->IfcBuilding IfcBuildingStorey ->IfcBuilding IfcWall ->IfcBuildingStorey IfcBuildingElementPart ->IfcWall. The IFC assignmentTable set (assignmentTable) is in "child ->parent" format. Example: IfcWall ->IfcRelAssignsToGroup IfcRelAssignsToGroup ->IfcGroup. The IFC Type Products (typeProductTable) is in "child ->parent" format. Example: IfcWall ->IfcWallType.
Member Data Documentation
◆ assignmentTable
 API_IFCRelationshipData::assignmentTable
IFC Assigment links, IfcGroup, IfcZone, IfcSystem, IfcRelAssignsToGroup and IfcRelServicesBuildings.
◆ containmentTable
 API_IFCRelationshipData::containmentTable
IFC containment tree in "child->parent" format.
◆ relFillsTable
 API_IFCRelationshipData::relFillsTable
Relationships between openings (Doors/Windows/Skylights) and IfcOpeningElements (voids).
◆ relVoidsTable
 API_IFCRelationshipData::relVoidsTable
Relationships between IfcOpeningElements (voids) and their parent IfcWall or IfcSlab.
◆ typeProductTable
 API_IFCRelationshipData::typeProductTable
IFC Type Products tree.